{"backend": "tensorflow", "class_name": "Model", "config": {"output_layers": [["dense_10", 0, 0]], "input_layers": [["input_2", 0, 0], ["reshape_2_input", 0, 0]], "layers": [{"name": "input_2", "class_name": "InputLayer", "config": {"dtype": "float32", "name": "input_2", "batch_input_shape": [null, 30, 300], "sparse": false}, "inbound_nodes": []}, {"name": "lstm_6", "class_name": "LSTM", "config": {"unit_forget_bias": true, "recurrent_constraint": null, "recurrent_dropout": 0.0, "unroll": false, "recurrent_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "go_backwards": false, "units": 512, "stateful": false, "kernel_regularizer": null, "implementation": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "activation": "tanh", "use_bias": true, "return_sequences": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dropout": 0.0, "trainable": true, "bias_regularizer": null, "name": "lstm_6", "return_state": true, "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "recurrent_activation": "hard_sigmoid"}, "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"name": "lstm_7", "class_name": "LSTM", "config": {"unit_forget_bias": true, "recurrent_constraint": null, "recurrent_dropout": 0.0, "unroll": false, "recurrent_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "go_backwards": false, "units": 512, "stateful": false, "kernel_regularizer": null, "implementation": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "activation": "tanh", "use_bias": true, "return_sequences": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dropout": 0.0, "trainable": true, "bias_regularizer": null, "name": "lstm_7", "return_state": true, "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "recurrent_activation": "hard_sigmoid"}, "inbound_nodes": [[["lstm_6", 0, 0, {}], ["lstm_6", 0, 1, {}], ["lstm_6", 0, 2, {}]]]}, {"name": "lstm_8", "class_name": "LSTM", "config": {"unit_forget_bias": true, "recurrent_constraint": null, "recurrent_dropout": 0.0, "unroll": false, "recurrent_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "go_backwards": false, "units": 512, "stateful": false, "kernel_regularizer": null, "implementation": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "activation": "tanh", "use_bias": true, "return_sequences": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dropout": 0.0, "trainable": true, "bias_regularizer": null, "name": "lstm_8", "return_state": true, "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "recurrent_activation": "hard_sigmoid"}, "inbound_nodes": [[["lstm_7", 0, 0, {}], ["lstm_7", 0, 1, {}], ["lstm_7", 0, 2, {}]]]}, {"name": "lstm_9", "class_name": "LSTM", "config": {"unit_forget_bias": true, "recurrent_constraint": null, "recurrent_dropout": 0.0, "unroll": false, "recurrent_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "go_backwards": false, "units": 512, "stateful": false, "kernel_regularizer": null, "implementation": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "activation": "tanh", "use_bias": true, "return_sequences": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dropout": 0.0, "trainable": true, "bias_regularizer": null, "name": "lstm_9", "return_state": true, "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "recurrent_activation": "hard_sigmoid"}, "inbound_nodes": [[["lstm_8", 0, 0, {}], ["lstm_8", 0, 1, {}], ["lstm_8", 0, 2, {}]]]}, {"name": "reshape_2_input", "class_name": "InputLayer", "config": {"dtype": "float32", "name": "reshape_2_input", "batch_input_shape": [null, 4096], "sparse": false}, "inbound_nodes": []}, {"name": "lstm_10", "class_name": "LSTM", "config": {"unit_forget_bias": true, "recurrent_constraint": null, "recurrent_dropout": 0.0, "unroll": false, "recurrent_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "go_backwards": false, "units": 512, "stateful": false, "kernel_regularizer": null, "implementation": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "activation": "tanh", "use_bias": true, "return_sequences": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dropout": 0.0, "trainable": true, "bias_regularizer": null, "name": "lstm_10", "return_state": true, "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "recurrent_activation": "hard_sigmoid"}, "inbound_nodes": [[["lstm_9", 0, 0, {}], ["lstm_9", 0, 1, {}], ["lstm_9", 0, 2, {}]]]}, {"name": "reshape_2", "class_name": "Reshape", "config": {"dtype": "float32", "trainable": true, "name": "reshape_2", "batch_input_shape": [null, 4096], "target_shape": [4096]}, "inbound_nodes": [[["reshape_2_input", 0, 0, {}]]]}, {"name": "concatenate_2", "class_name": "Concatenate", "config": {"trainable": true, "axis": -1, "name": "concatenate_2"}, "inbound_nodes": [[["lstm_10", 0, 1, {}], ["lstm_10", 0, 2, {}]]]}, {"name": "dense_6", "class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "activation": "tanh", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "units": 1024, "name": "dense_6"}, "inbound_nodes": [[["reshape_2", 0, 0, {}]]]}, {"name": "multiply_2", "class_name": "Multiply", "config": {"trainable": true, "name": "multiply_2"}, "inbound_nodes": [[["concatenate_2", 0, 0, {}], ["dense_6", 0, 0, {}]]]}, {"name": "dense_7", "class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "activation": "tanh", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "units": 1024, "name": "dense_7"}, "inbound_nodes": [[["multiply_2", 0, 0, {}]]]}, {"name": "dense_8", "class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "activation": "tanh", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "units": 1024, "name": "dense_8"}, "inbound_nodes": [[["dense_7", 0, 0, {}]]]}, {"name": "dropout_3", "class_name": "Dropout", "config": {"noise_shape": null, "trainable": true, "name": "dropout_3", "rate": 0.5, "seed": null}, "inbound_nodes": [[["dense_8", 0, 0, {}]]]}, {"name": "dense_9", "class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "activation": "tanh", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "units": 1024, "name": "dense_9"}, "inbound_nodes": [[["dropout_3", 0, 0, {}]]]}, {"name": "dropout_4", "class_name": "Dropout", "config": {"noise_shape": null, "trainable": true, "name": "dropout_4", "rate": 0.7, "seed": null}, "inbound_nodes": [[["dense_9", 0, 0, {}]]]}, {"name": "dense_10", "class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "activation": "softmax", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "units": 1000, "name": "dense_10"}, "inbound_nodes": [[["dropout_4", 0, 0, {}]]]}], "name": "model_4"}, "keras_version": "2.2.4"}