{"class_name": "Model", "backend": "tensorflow", "config": {"output_layers": [["dense_5", 0, 0]], "input_layers": [["input_1", 0, 0], ["reshape_1_input", 0, 0]], "name": "model_2", "layers": [{"config": {"dtype": "float32", "sparse": false, "name": "input_1", "batch_input_shape": [null, 30, 300]}, "class_name": "InputLayer", "inbound_nodes": [], "name": "input_1"}, {"config": {"implementation": 1, "units": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "unroll": false, "go_backwards": false, "recurrent_dropout": 0.0, "name": "lstm_1", "unit_forget_bias": true, "dropout": 0.0, "kernel_regularizer": null, "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "recurrent_activation": "hard_sigmoid", "recurrent_regularizer": null, "bias_constraint": null, "return_sequences": true, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "recurrent_constraint": null, "stateful": false, "return_state": true, "activation": "tanh"}, "class_name": "LSTM", "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "lstm_1"}, {"config": {"implementation": 1, "units": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "unroll": false, "go_backwards": false, "recurrent_dropout": 0.0, "name": "lstm_2", "unit_forget_bias": true, "dropout": 0.0, "kernel_regularizer": null, "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "recurrent_activation": "hard_sigmoid", "recurrent_regularizer": null, "bias_constraint": null, "return_sequences": true, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "recurrent_constraint": null, "stateful": false, "return_state": true, "activation": "tanh"}, "class_name": "LSTM", "inbound_nodes": [[["lstm_1", 0, 0, {}], ["lstm_1", 0, 1, {}], ["lstm_1", 0, 2, {}]]], "name": "lstm_2"}, {"config": {"implementation": 1, "units": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "unroll": false, "go_backwards": false, "recurrent_dropout": 0.0, "name": "lstm_3", "unit_forget_bias": true, "dropout": 0.0, "kernel_regularizer": null, "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "recurrent_activation": "hard_sigmoid", "recurrent_regularizer": null, "bias_constraint": null, "return_sequences": true, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "recurrent_constraint": null, "stateful": false, "return_state": true, "activation": "tanh"}, "class_name": "LSTM", "inbound_nodes": [[["lstm_2", 0, 0, {}], ["lstm_2", 0, 1, {}], ["lstm_2", 0, 2, {}]]], "name": "lstm_3"}, {"config": {"implementation": 1, "units": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "unroll": false, "go_backwards": false, "recurrent_dropout": 0.0, "name": "lstm_4", "unit_forget_bias": true, "dropout": 0.0, "kernel_regularizer": null, "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "recurrent_activation": "hard_sigmoid", "recurrent_regularizer": null, "bias_constraint": null, "return_sequences": true, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "recurrent_constraint": null, "stateful": false, "return_state": true, "activation": "tanh"}, "class_name": "LSTM", "inbound_nodes": [[["lstm_3", 0, 0, {}], ["lstm_3", 0, 1, {}], ["lstm_3", 0, 2, {}]]], "name": "lstm_4"}, {"config": {"dtype": "float32", "sparse": false, "name": "reshape_1_input", "batch_input_shape": [null, 2048]}, "class_name": "InputLayer", "inbound_nodes": [], "name": "reshape_1_input"}, {"config": {"implementation": 1, "units": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "unroll": false, "go_backwards": false, "recurrent_dropout": 0.0, "name": "lstm_5", "unit_forget_bias": true, "dropout": 0.0, "kernel_regularizer": null, "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "recurrent_activation": "hard_sigmoid", "recurrent_regularizer": null, "bias_constraint": null, "return_sequences": false, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "recurrent_constraint": null, "stateful": false, "return_state": true, "activation": "tanh"}, "class_name": "LSTM", "inbound_nodes": [[["lstm_4", 0, 0, {}], ["lstm_4", 0, 1, {}], ["lstm_4", 0, 2, {}]]], "name": "lstm_5"}, {"config": {"dtype": "float32", "batch_input_shape": [null, 2048], "target_shape": [2048], "name": "reshape_1", "trainable": true}, "class_name": "Reshape", "inbound_nodes": [[["reshape_1_input", 0, 0, {}]]], "name": "reshape_1"}, {"config": {"trainable": true, "axis": -1, "name": "concatenate_1"}, "class_name": "Concatenate", "inbound_nodes": [[["lstm_5", 0, 1, {}], ["lstm_5", 0, 2, {}]]], "name": "concatenate_1"}, {"config": {"activity_regularizer": null, "units": 1024, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "use_bias": true, "bias_constraint": null, "name": "dense_1", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_regularizer": null, "activation": "tanh", "trainable": true}, "class_name": "Dense", "inbound_nodes": [[["reshape_1", 0, 0, {}]]], "name": "dense_1"}, {"config": {"name": "multiply_1", "trainable": true}, "class_name": "Multiply", "inbound_nodes": [[["concatenate_1", 0, 0, {}], ["dense_1", 0, 0, {}]]], "name": "multiply_1"}, {"config": {"activity_regularizer": null, "units": 1024, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "use_bias": true, "bias_constraint": null, "name": "dense_2", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_regularizer": null, "activation": "tanh", "trainable": true}, "class_name": "Dense", "inbound_nodes": [[["multiply_1", 0, 0, {}]]], "name": "dense_2"}, {"config": {"activity_regularizer": null, "units": 1024, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "use_bias": true, "bias_constraint": null, "name": "dense_3", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_regularizer": null, "activation": "tanh", "trainable": true}, "class_name": "Dense", "inbound_nodes": [[["dense_2", 0, 0, {}]]], "name": "dense_3"}, {"config": {"trainable": true, "seed": null, "rate": 0.5, "noise_shape": null, "name": "dropout_1"}, "class_name": "Dropout", "inbound_nodes": [[["dense_3", 0, 0, {}]]], "name": "dropout_1"}, {"config": {"activity_regularizer": null, "units": 1024, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "use_bias": true, "bias_constraint": null, "name": "dense_4", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_regularizer": null, "activation": "tanh", "trainable": true}, "class_name": "Dense", "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "name": "dense_4"}, {"config": {"trainable": true, "seed": null, "rate": 0.5, "noise_shape": null, "name": "dropout_2"}, "class_name": "Dropout", "inbound_nodes": [[["dense_4", 0, 0, {}]]], "name": "dropout_2"}, {"config": {"activity_regularizer": null, "units": 1000, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "use_bias": true, "bias_constraint": null, "name": "dense_5", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_regularizer": null, "activation": "softmax", "trainable": true}, "class_name": "Dense", "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "name": "dense_5"}]}, "keras_version": "2.2.4"}