{"backend": "tensorflow", "keras_version": "2.2.4", "config": {"name": "model_2", "input_layers": [["input_1", 0, 0], ["reshape_1_input", 0, 0]], "output_layers": [["dense_5", 0, 0]], "layers": [{"name": "input_1", "inbound_nodes": [], "config": {"name": "input_1", "sparse": false, "dtype": "float32", "batch_input_shape": [null, 30, 300]}, "class_name": "InputLayer"}, {"name": "lstm_1", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"units": 512, "unroll": false, "bias_regularizer": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "recurrent_dropout": 0.0, "implementation": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "return_state": true, "recurrent_regularizer": null, "recurrent_constraint": null, "go_backwards": false, "name": "lstm_1", "kernel_regularizer": null, "activation": "tanh", "return_sequences": true, "dropout": 0.0, "use_bias": true, "activity_regularizer": null, "unit_forget_bias": true, "stateful": false, "recurrent_activation": "hard_sigmoid", "trainable": true, "bias_constraint": null, "kernel_constraint": null}, "class_name": "LSTM"}, {"name": "lstm_2", "inbound_nodes": [[["lstm_1", 0, 0, {}], ["lstm_1", 0, 1, {}], ["lstm_1", 0, 2, {}]]], "config": {"units": 512, "unroll": false, "bias_regularizer": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "recurrent_dropout": 0.0, "implementation": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "return_state": true, "recurrent_regularizer": null, "recurrent_constraint": null, "go_backwards": false, "name": "lstm_2", "kernel_regularizer": null, "activation": "tanh", "return_sequences": true, "dropout": 0.0, "use_bias": true, "activity_regularizer": null, "unit_forget_bias": true, "stateful": false, "recurrent_activation": "hard_sigmoid", "trainable": true, "bias_constraint": null, "kernel_constraint": null}, "class_name": "LSTM"}, {"name": "lstm_3", "inbound_nodes": [[["lstm_2", 0, 0, {}], ["lstm_2", 0, 1, {}], ["lstm_2", 0, 2, {}]]], "config": {"units": 512, "unroll": false, "bias_regularizer": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "recurrent_dropout": 0.0, "implementation": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "return_state": true, "recurrent_regularizer": null, "recurrent_constraint": null, "go_backwards": false, "name": "lstm_3", "kernel_regularizer": null, "activation": "tanh", "return_sequences": true, "dropout": 0.0, "use_bias": true, "activity_regularizer": null, "unit_forget_bias": true, "stateful": false, "recurrent_activation": "hard_sigmoid", "trainable": true, "bias_constraint": null, "kernel_constraint": null}, "class_name": "LSTM"}, {"name": "lstm_4", "inbound_nodes": [[["lstm_3", 0, 0, {}], ["lstm_3", 0, 1, {}], ["lstm_3", 0, 2, {}]]], "config": {"units": 512, "unroll": false, "bias_regularizer": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "recurrent_dropout": 0.0, "implementation": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "return_state": true, "recurrent_regularizer": null, "recurrent_constraint": null, "go_backwards": false, "name": "lstm_4", "kernel_regularizer": null, "activation": "tanh", "return_sequences": true, "dropout": 0.0, "use_bias": true, "activity_regularizer": null, "unit_forget_bias": true, "stateful": false, "recurrent_activation": "hard_sigmoid", "trainable": true, "bias_constraint": null, "kernel_constraint": null}, "class_name": "LSTM"}, {"name": "reshape_1_input", "inbound_nodes": [], "config": {"name": "reshape_1_input", "sparse": false, "dtype": "float32", "batch_input_shape": [null, 2048]}, "class_name": "InputLayer"}, {"name": "lstm_5", "inbound_nodes": [[["lstm_4", 0, 0, {}], ["lstm_4", 0, 1, {}], ["lstm_4", 0, 2, {}]]], "config": {"units": 512, "unroll": false, "bias_regularizer": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "recurrent_dropout": 0.0, "implementation": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "return_state": true, "recurrent_regularizer": null, "recurrent_constraint": null, "go_backwards": false, "name": "lstm_5", "kernel_regularizer": null, "activation": "tanh", "return_sequences": false, "dropout": 0.0, "use_bias": true, "activity_regularizer": null, "unit_forget_bias": true, "stateful": false, "recurrent_activation": "hard_sigmoid", "trainable": true, "bias_constraint": null, "kernel_constraint": null}, "class_name": "LSTM"}, {"name": "reshape_1", "inbound_nodes": [[["reshape_1_input", 0, 0, {}]]], "config": {"name": "reshape_1", "target_shape": [2048], "trainable": true, "batch_input_shape": [null, 2048], "dtype": "float32"}, "class_name": "Reshape"}, {"name": "concatenate_1", "inbound_nodes": [[["lstm_5", 0, 1, {}], ["lstm_5", 0, 2, {}]]], "config": {"name": "concatenate_1", "axis": -1, "trainable": true}, "class_name": "Concatenate"}, {"name": "dense_1", "inbound_nodes": [[["reshape_1", 0, 0, {}]]], "config": {"units": 1024, "bias_regularizer": null, "activation": "tanh", "use_bias": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "name": "dense_1", "kernel_regularizer": null, "bias_constraint": null, "kernel_constraint": null}, "class_name": "Dense"}, {"name": "multiply_1", "inbound_nodes": [[["concatenate_1", 0, 0, {}], ["dense_1", 0, 0, {}]]], "config": {"name": "multiply_1", "trainable": true}, "class_name": "Multiply"}, {"name": "dense_2", "inbound_nodes": [[["multiply_1", 0, 0, {}]]], "config": {"units": 1024, "bias_regularizer": null, "activation": "tanh", "use_bias": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "name": "dense_2", "kernel_regularizer": null, "bias_constraint": null, "kernel_constraint": null}, "class_name": "Dense"}, {"name": "dense_3", "inbound_nodes": [[["dense_2", 0, 0, {}]]], "config": {"units": 1024, "bias_regularizer": null, "activation": "tanh", "use_bias": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "name": "dense_3", "kernel_regularizer": null, "bias_constraint": null, "kernel_constraint": null}, "class_name": "Dense"}, {"name": "dropout_1", "inbound_nodes": [[["dense_3", 0, 0, {}]]], "config": {"name": "dropout_1", "rate": 0.5, "trainable": true, "seed": null, "noise_shape": null}, "class_name": "Dropout"}, {"name": "dense_4", "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "config": {"units": 1024, "bias_regularizer": null, "activation": "tanh", "use_bias": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "name": "dense_4", "kernel_regularizer": null, "bias_constraint": null, "kernel_constraint": null}, "class_name": "Dense"}, {"name": "dropout_2", "inbound_nodes": [[["dense_4", 0, 0, {}]]], "config": {"name": "dropout_2", "rate": 0.5, "trainable": true, "seed": null, "noise_shape": null}, "class_name": "Dropout"}, {"name": "dense_5", "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "config": {"units": 1000, "bias_regularizer": null, "activation": "softmax", "use_bias": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "name": "dense_5", "kernel_regularizer": null, "bias_constraint": null, "kernel_constraint": null}, "class_name": "Dense"}]}, "class_name": "Model"}